app/views/school_classes/edit.html.erb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 3]]
---
<%= form_for(SchoolClass.find(params[:id])) do |f| %>